indoor/app/layout/resource/onvif/indoor_set_device_password.xml

POST /onvif/device_service HTTP/1.1
Content-Type: application/soap+xml; charset=utf-8; action="http://www.onvif.org/ver10/device/wsdl/SetUser"
Host: %s
%sContent-Length: %d
Accept-Encoding: gzip, deflate
Connection: Close

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
       %s<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
                <SetUser xmlns="http://www.onvif.org/ver10/device/wsdl">
                        <User>
                                <Username xmlns="http://www.onvif.org/ver10/schema">admin</Username>
                                <Password xmlns="http://www.onvif.org/ver10/schema">%s</Password>
                                <UserLevel xmlns="http://www.onvif.org/ver10/schema">Administrator</UserLevel>
                        </User>
                </SetUser>
        </s:Body>
</s:Envelope>